app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "a@a.com"]]
---
  def login
    user = User.find_by(email: params[:user][:email])

UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def profile
    current_user.update(bio: params[:newbio])